<?php
/**
 * UNIT種別名のENUMファイル
 * 
 * ライブラリ用
 */

namespace SocketManager\Library;


/**
 * UNITの規定の種別名定義
 * 
 * ライブラリ用
 */
enum UnitKindEnum: string
{
    //--------------------------------------------------------------------------
    // 定数
    //--------------------------------------------------------------------------

    /**
     * @var プロトコルUNIT種別
     */
    case PROTOCOL = 'protocol_names';

    /**
     * @var コマンドUNIT種別
     */
    case COMMAND = 'command_names';

    /**
     * @var エンジンUNIT種別
     */
    case ENGINE = 'engine_names';


    //--------------------------------------------------------------------------
    // メソッド
    //--------------------------------------------------------------------------

}
